# Задача 1. Циклы — это сложно?
#
# Даша начала проходить циклы. Она написала программу, которая просто должна считать сумму чисел до тех пор,
# пока мы не ввели 0, но что-то пошло не так.
#
# number = int(input(‘Введите число: ’))
# While number <= 0:
#  summ += number
#  number = int(input(‘Введите число: ’))
# print(Summ)
#
#
# Скопируйте программу в редактор, исправьте её и убедитесь в правильности работы программы.
#
#
#

number = int(input("Введите число: "))
summ = 0
while number != 0:
    summ += number
    number = int(input("Введите число: "))

print(summ)

# Задача 2. Введите пароль
#
# Когда мы включаем ноутбук, он просит нас ввести пароль. Если пароль оказался неверным,
# нам сообщают об этом и снова просят ввести пароль. И так до тех пор, пока мы не введём правильный пароль, —
# тогда ноутбук даст доступ в учётную запись, и программа завершится.
#
# Напишите программу, которая запрашивает у пользователя пароль до тех пор, пока он не введёт верный (верным будет считаться пароль 235).
#
#
#
# Пример:
#
# Введите пароль: 100000
#
# Неверный пароль!
#
# Попробуйте ещё раз: 500
#
# Неверный пароль!
#
# Попробуйте ещё раз: 235
#
# Пароль верный! Добро пожаловать.
#
#
#

true_password = 235
user_input = int(input("Введите пароль: "))

while user_input != true_password:
    print("Неверный пароль!")
    user_input = int(input("Попробуйте ещё раз: "))

print("Пароль верный! Добро пожаловать.")

# Задача 3. Накопления
#
# Кирилл копит себе на хорошую новенькую машину и для этого он каждый раз откладывает в копилку определённую сумму с зарплаты.
#
# Напишите программу, которая спрашивает у пользователя «Сколько отложить денег?» до тех пор,
# пока сумма в копилке не превысит или не станет равна 500 000 рублей.

car_price = 500000
my_money = 0
while my_money < car_price:
    my_money += int(input("Сколько отложить денег? "))
print("Денег хватает!")
